Revit 2026 API

# PipeSettingsSetUp Property

---

The abbreviation of the Set Up (SU) string.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SetUp { get; set; }
```
```vb
Public Property SetUp As String
	Get
	Set
```
```cpp
public:
property String^ SetUp {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SetUp : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

PipeSettings Class

Autodesk.Revit.DB.Plumbing Namespace